import 'package:flutter/material.dart';
import 'package:mango_leaf_disease/model/symtoms_model.dart';

class SymtomProvider with ChangeNotifier {
  final List<SymtomsModel> _model = [
    SymtomsModel(
      title: "অ্যানথ্রাকনোজ",
      subtitle: "Anthracnose",
      discription:
          "পাতায় বাদামি থেকে কালো রঙের দাগ পড়ে এবং পাতা শুকিয়ে যায়।",
      symtom: ["পাতায় বাদামি দাগ", "পাতা শুকিয়ে যাওয়া", 'ফলে কালো দাগ'],
      cure: "কপার অক্সিক্লোরাইড স্প্রে করুন।",
      resistance: [
        "নিয়মিত বাগান পরিষ্কার রাখুন",
        "আক্রান্ত পাতা সংগ্রহ করে ধ্বংস করুন",
        'সময়মত ছত্রাকনাশক প্রয়োগ করুন',
      ],
    ),
    SymtomsModel(
      title: "ব্যাকটেরিয়াল ক্যাঙ্কার",
      subtitle: "Bacterial Canker",
      discription: "পাতায় ছোট ছোট হলুদ দাগ দেখা যায়, পরে বাদামি রঙ ধারণ করে।",
      symtom: ["পাতায় হলুদ দাগ", "ডালে ক্যাঙ্কার", 'পাতা ঝরে যাওয়া'],
      cure: "স্ট্রেপ্টোমাইসিন সালফেট + কপার অক্সিক্লোরাইড স্প্রে করুন।",
      resistance: [
        "রোগ প্রতিরোধী জাত ব্যবহার করুন",
        "সঠিক দূরত্বে চারা রোপণ করুন",
        'নিয়মিত পর্যবেক্ষণ করুন ',
      ],
    ),
    SymtomsModel(
      title: "পাউডারি মিলডিউ",
      subtitle: "Powdery Mildew",
      discription: "পাতায় সাদা পাউডারের মতো আবরণ দেখা যায়।",
      symtom: ["পাতায় সাদা পাউডার", "পাতা কুঁকড়ে যাওয়া", 'ফলের বৃদ্ধি কম'],
      cure: "সালফার ভিত্তিক ছত্রাকনাশক স্প্রে করুন।",
      resistance: [
        "বাগানে বায়ু চলাচল বাড়ান",
        "আক্রান্ত অংশ অপসারণ করুন",
        'প্রতিরোধী জাত ব্যবহার করুন ',
      ],
    ),
    SymtomsModel(
      title: "সুটি মোল্ড",
      subtitle: "Sooty Mould",
      discription: "পাতায় কালো ধূলার মতো আবরণ দেখা যায়।",
      symtom: [
        "পাতায় কালো আবরণ",
        "ফটোসিনথেসিস কমে যাওয়া",
        'গাছের বৃদ্ধি ব্যাহত',
      ],
      cure: "স্টিকার মিশ্রিত কীটনাশক স্প্রে করুন ",
      resistance: [
        "পোকামাকড় নিয়ন্ত্রণ করুন",
        "সঠিক সারের ব্যবহার",
        'নিয়মিত পরিদর্শন',
      ],
    ),
    SymtomsModel(
      title: "ডাইব্যাক",
      subtitle: "Dieback",
      discription:
          "ডালের আগা শুকিয়ে যায় এবং ধীরে ধীরে নিচের দিকে মরে যেতে থাকে।",
      symtom: ["ডালের আগা শুকানো", "পাতা ঝরে পড়া", "ফল ধরা কমে যাওয়া"],
      cure: "কার্বেনডাজিম অথবা থায়োফিনেট-মিথাইল স্প্রে করুন।",
      resistance: [
        "আক্রান্ত ডাল কেটে ফেলুন",
        "পর্যাপ্ত সার ও পানির ব্যবস্থা করুন",
        "পরিচ্ছন্নতা বজায় রাখুন",
      ],
    ),
  ];

  List<SymtomsModel> get model => _model;
}
